"""
案例:

演示 张量的索引操作.

分类:

简单行列索引

列表索引

范围索引

布尔索引

多维索引

掌握:

简单行列索引，范围索引，多维索引.
"""
# 导包
import torch
# 1.设计随机种子 这里为啥24，，，
torch.manual_seed(24)
# 2.创建随机张量 每个参数ai再回顾一下
t1 = torch.randint(1, 10, (5, 5))
print(f't1:{t1}')

# 3.演示张量的索引操作
# 场景1简单行列索引
# 获取第二行的数据 格式ai补上
print(t1[1])
print(t1[1, :]) #所有列的第二行
print(t1[: :]) #所有列的第二行 这一行为什么也可以到底啥意思，，我乱写的
print(t1[:, 2])


# 场景2列表索引 前面表示行 后面表示列 为什么是58而不是83 ai讲讲
print(t1[[0,1], [1, 2]])

print(t1[[1,3], [2, 4]])

# 需求 3 获取 第0，1行的1， 2列共4个元素 ai求你讲讲吧
print(t1[[[0], [1]], [1, 2]])
# 场景3范围索引
# 需求 前3行，前2列 什么语法 到底按照序列还是什么 包左不包右？
print(t1[:3, :2])
# 需求2 第2行到最后一行 前2列的数据
print(t1[1: ,:2])
# 需求3 第0，1行的1，2列四个元素的数据
print(t1[:2, :2 ])
# 需求4 所有奇数行所有偶数行
print(t1[1::2, ::2])
# 场景4布尔索引
# 需求1：第三列大于5的行数据 这个是什么语法
# print(t1[torch.tensor([True, False, True, True, True]), :]) #演示布尔写法
# 第三列大于5的行数据 直接打是布尔
# print(t1[:3] > 5)
# print(t1[torch.tensor(t1[:3] > 5)]) 也不对
print(t1[t1[:, 3] > 5]) #这个ai讲讲吧

# 需求：第2行 大于5的列数据 这个ai详细展开吧
# 理解1
print(t1[:, t1[1, :] > 5])
print(t1[:, t1[1] > 5])
# 理解2
print(t1[1, t1[1, :] > 5])
# 场景5多维索引
# 创建3维张量
t2 = torch.randint(1, 10, (2, 3, 4))
print(f't2:{t2}')

# 获取0轴的第一个数据 什么语法讲一下 每个轴是啥 1轴为什么3个元素
print(t2[0, : , :])
# 获取1轴的第1个数据
print(t2[:, 0 , :])
# 获取2轴的第2个数据
print(t2[:, : , 0])